java.lang.AbstractMethodError=\u62BD\u8C61\u65B9\u6CD5\u9519\u8BEF\u3002\u5F53\u5E94\u7528\u8BD5\u56FE\u8C03\u7528\u62BD\u8C61\u65B9\u6CD5\u65F6\u629B\u51FA\u3002

java.lang.AssertionError=\u65AD\u8A00\u9519\u3002\u7528\u6765\u6307\u793A\u4E00\u4E2A\u65AD\u8A00\u5931\u8D25\u7684\u60C5\u51B5\u3002

java.lang.ClassCircularityError=\u7C7B\u5FAA\u73AF\u4F9D\u8D56\u9519\u8BEF\u3002\u5728\u521D\u59CB\u5316\u4E00\u4E2A\u7C7B\u65F6\uFF0C\u82E5\u68C0\u6D4B\u5230\u7C7B\u4E4B\u95F4\u5FAA\u73AF\u4F9D\u8D56\u5219\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.ClassFormatError=\u7C7B\u683C\u5F0F\u9519\u8BEF\u3002\u5F53Java\u865A\u62DF\u673A\u8BD5\u56FE\u4ECE\u4E00\u4E2A\u6587\u4EF6\u4E2D\u8BFB\u53D6Java\u7C7B\uFF0C\u800C\u68C0\u6D4B\u5230\u8BE5\u6587\u4EF6\u7684\u5185\u5BB9\u4E0D\u7B26\u5408\u7C7B\u7684\u6709\u6548\u683C\u5F0F\u65F6\u629B\u51FA\u3002

java.lang.Error=\u9519\u8BEF\u3002\u662F\u6240\u6709\u9519\u8BEF\u7684\u57FA\u7C7B\uFF0C\u7528\u4E8E\u6807\u8BC6\u4E25\u91CD\u7684\u7A0B\u5E8F\u8FD0\u884C\u95EE\u9898\u3002\u8FD9\u4E9B\u95EE\u9898\u901A\u5E38\u63CF\u8FF0\u4E00\u4E9B\u4E0D\u5E94\u88AB\u5E94\u7528\u7A0B\u5E8F\u6355\u83B7\u7684\u53CD\u5E38\u60C5\u51B5\u3002

java.lang.ExceptionInInitializerError=\u521D\u59CB\u5316\u7A0B\u5E8F\u9519\u8BEF\u3002\u5F53\u6267\u884C\u4E00\u4E2A\u7C7B\u7684\u9759\u6001\u521D\u59CB\u5316\u7A0B\u5E8F\u7684\u8FC7\u7A0B\u4E2D\uFF0C\u53D1\u751F\u4E86\u5F02\u5E38\u65F6\u629B\u51FA\u3002\u9759\u6001\u521D\u59CB\u5316\u7A0B\u5E8F\u662F\u6307\u76F4\u63A5\u5305\u542B\u4E8E\u7C7B\u4E2D\u7684static\u8BED\u53E5\u6BB5\u3002

java.lang.IllegalAccessError=\u8FDD\u6CD5\u8BBF\u95EE\u9519\u8BEF\u3002\u5F53\u4E00\u4E2A\u5E94\u7528\u8BD5\u56FE\u8BBF\u95EE\u3001\u4FEE\u6539\u67D0\u4E2A\u7C7B\u7684\u57DF\uFF08Field\uFF09\u6216\u8005\u8C03\u7528\u5176\u65B9\u6CD5\uFF0C\u4F46\u662F\u53C8\u8FDD\u53CD\u57DF\u6216\u65B9\u6CD5\u7684\u53EF\u89C1\u6027\u58F0\u660E\uFF0C\u5219\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.IncompatibleClassChangeError=\u4E0D\u517C\u5BB9\u7684\u7C7B\u53D8\u5316\u9519\u8BEF\u3002\u5F53\u6B63\u5728\u6267\u884C\u7684\u65B9\u6CD5\u6240\u4F9D\u8D56\u7684\u7C7B\u5B9A\u4E49\u53D1\u751F\u4E86\u4E0D\u517C\u5BB9\u7684\u6539\u53D8\u65F6\uFF0C\u629B\u51FA\u8BE5\u5F02\u5E38\u3002\u4E00\u822C\u5728\u4FEE\u6539\u4E86\u5E94\u7528\u4E2D\u7684\u67D0\u4E9B\u7C7B\u7684\u58F0\u660E\u5B9A\u4E49\u800C\u6CA1\u6709\u5BF9\u6574\u4E2A\u5E94\u7528\u91CD\u65B0\u7F16\u8BD1\u800C\u76F4\u63A5\u8FD0\u884C\u7684\u60C5\u51B5\u4E0B\uFF0C\u5BB9\u6613\u5F15\u53D1\u8BE5\u9519\u8BEF\u3002

java.lang.InstantiationError=\u5B9E\u4F8B\u5316\u9519\u8BEF\u3002\u5F53\u4E00\u4E2A\u5E94\u7528\u8BD5\u56FE\u901A\u8FC7Java\u7684new\u64CD\u4F5C\u7B26\u6784\u9020\u4E00\u4E2A\u62BD\u8C61\u7C7B\u6216\u8005\u63A5\u53E3\u65F6\u629B\u51FA\u8BE5\u5F02\u5E38.

java.lang.InternalError=\u5185\u90E8\u9519\u8BEF\u3002\u7528\u4E8E\u6307\u793AJava\u865A\u62DF\u673A\u53D1\u751F\u4E86\u5185\u90E8\u9519\u8BEF\u3002

java.lang.LinkageError=\u94FE\u63A5\u9519\u8BEF\u3002\u8BE5\u9519\u8BEF\u53CA\u5176\u6240\u6709\u5B50\u7C7B\u6307\u793A\u67D0\u4E2A\u7C7B\u4F9D\u8D56\u4E8E\u53E6\u5916\u4E00\u4E9B\u7C7B\uFF0C\u5728\u8BE5\u7C7B\u7F16\u8BD1\u4E4B\u540E\uFF0C\u88AB\u4F9D\u8D56\u7684\u7C7B\u6539\u53D8\u4E86\u5176\u7C7B\u5B9A\u4E49\u800C\u6CA1\u6709\u91CD\u65B0\u7F16\u8BD1\u6240\u6709\u7684\u7C7B\uFF0C\u8FDB\u800C\u5F15\u53D1\u9519\u8BEF\u7684\u60C5\u51B5\u3002

java.lang.NoClassDefFoundError=\u672A\u627E\u5230\u7C7B\u5B9A\u4E49\u9519\u8BEF\u3002\u5F53Java\u865A\u62DF\u673A\u6216\u8005\u7C7B\u88C5\u8F7D\u5668\u8BD5\u56FE\u5B9E\u4F8B\u5316\u67D0\u4E2A\u7C7B\uFF0C\u800C\u627E\u4E0D\u5230\u8BE5\u7C7B\u7684\u5B9A\u4E49\u65F6\u629B\u51FA\u8BE5\u9519\u8BEF\u3002

java.lang.NoSuchFieldError=\u57DF\u4E0D\u5B58\u5728\u9519\u8BEF\u3002\u5F53\u5E94\u7528\u8BD5\u56FE\u8BBF\u95EE\u6216\u8005\u4FEE\u6539\u67D0\u7C7B\u7684\u67D0\u4E2A\u57DF\uFF0C\u800C\u8BE5\u7C7B\u7684\u5B9A\u4E49\u4E2D\u6CA1\u6709\u8BE5\u57DF\u7684\u5B9A\u4E49\u65F6\u629B\u51FA\u8BE5\u9519\u8BEF\u3002

java.lang.NoSuchMethodError=\u65B9\u6CD5\u4E0D\u5B58\u5728\u9519\u8BEF\u3002\u5F53\u5E94\u7528\u8BD5\u56FE\u8C03\u7528\u67D0\u7C7B\u7684\u67D0\u4E2A\u65B9\u6CD5\uFF0C\u800C\u8BE5\u7C7B\u7684\u5B9A\u4E49\u4E2D\u6CA1\u6709\u8BE5\u65B9\u6CD5\u7684\u5B9A\u4E49\u65F6\u629B\u51FA\u8BE5\u9519\u8BEF\u3002

java.lang.OutOfMemoryError=\u5185\u5B58\u4E0D\u8DB3\u9519\u8BEF\u3002\u5F53\u53EF\u7528\u5185\u5B58\u4E0D\u8DB3\u4EE5\u8BA9Java\u865A\u62DF\u673A\u5206\u914D\u7ED9\u4E00\u4E2A\u5BF9\u8C61\u65F6\u629B\u51FA\u8BE5\u9519\u8BEF\u3002

java.lang.StackOverflowError=\u5806\u6808\u6EA2\u51FA\u9519\u8BEF\u3002\u5F53\u4E00\u4E2A\u5E94\u7528\u9012\u5F52\u8C03\u7528\u7684\u5C42\u6B21\u592A\u6DF1\u800C\u5BFC\u81F4\u5806\u6808\u6EA2\u51FA\u65F6\u629B\u51FA\u8BE5\u9519\u8BEF\u3002

java.lang.ThreadDeath=\u7EBF\u7A0B\u7ED3\u675F\u3002\u5F53\u8C03\u7528Thread\u7C7B\u7684stop\u65B9\u6CD5\u65F6\u629B\u51FA\u8BE5\u9519\u8BEF\uFF0C\u7528\u4E8E\u6307\u793A\u7EBF\u7A0B\u7ED3\u675F\u3002

java.lang.UnknownError=\u672A\u77E5\u9519\u8BEF\u3002\u7528\u4E8E\u6307\u793AJava\u865A\u62DF\u673A\u53D1\u751F\u4E86\u672A\u77E5\u4E25\u91CD\u9519\u8BEF\u7684\u60C5\u51B5\u3002

java.lang.UnsatisfiedLinkError=\u672A\u6EE1\u8DB3\u7684\u94FE\u63A5\u9519\u8BEF\u3002\u5F53Java\u865A\u62DF\u673A\u672A\u627E\u5230\u67D0\u4E2A\u7C7B\u7684\u58F0\u660E\u4E3Anative\u65B9\u6CD5\u7684\u672C\u673A\u8BED\u8A00\u5B9A\u4E49\u65F6\u629B\u51FA\u3002

java.lang.UnsupportedClassVersionError=\u4E0D\u652F\u6301\u7684\u7C7B\u7248\u672C\u9519\u8BEF\u3002\u5F53Java\u865A\u62DF\u673A\u8BD5\u56FE\u4ECE\u8BFB\u53D6\u67D0\u4E2A\u7C7B\u6587\u4EF6\uFF0C\u4F46\u662F\u53D1\u73B0\u8BE5\u6587\u4EF6\u7684\u4E3B\u3001\u6B21\u7248\u672C\u53F7\u4E0D\u88AB\u5F53\u524DJava\u865A\u62DF\u673A\u652F\u6301\u7684\u65F6\u5019\uFF0C\u629B\u51FA\u8BE5\u9519\u8BEF\u3002

java.lang.VerifyError=\u9A8C\u8BC1\u9519\u8BEF\u3002\u5F53\u9A8C\u8BC1\u5668\u68C0\u6D4B\u5230\u67D0\u4E2A\u7C7B\u6587\u4EF6\u4E2D\u5B58\u5728\u5185\u90E8\u4E0D\u517C\u5BB9\u6216\u8005\u5B89\u5168\u95EE\u9898\u65F6\u629B\u51FA\u8BE5\u9519\u8BEF\u3002

java.lang.VirtualMachineError=\u865A\u62DF\u673A\u9519\u8BEF\u3002\u7528\u4E8E\u6307\u793A\u865A\u62DF\u673A\u88AB\u7834\u574F\u6216\u8005\u7EE7\u7EED\u6267\u884C\u64CD\u4F5C\u6240\u9700\u7684\u8D44\u6E90\u4E0D\u8DB3\u7684\u60C5\u51B5\u3002

java.lang.ArithmeticException=\u7B97\u672F\u6761\u4EF6\u5F02\u5E38\u3002\u8B6C\u5982\uFF1A\u6574\u6570\u9664\u96F6\u7B49\u3002

java.lang.ArrayIndexOutOfBoundsException=\u6570\u7EC4\u7D22\u5F15\u8D8A\u754C\u5F02\u5E38\u3002\u5F53\u5BF9\u6570\u7EC4\u7684\u7D22\u5F15\u503C\u4E3A\u8D1F\u6570\u6216\u5927\u4E8E\u7B49\u4E8E\u6570\u7EC4\u5927\u5C0F\u65F6\u629B\u51FA\u3002

java.lang.ArrayStoreException=\u6570\u7EC4\u5B58\u50A8\u5F02\u5E38\u3002\u5F53\u5411\u6570\u7EC4\u4E2D\u5B58\u653E\u975E\u6570\u7EC4\u58F0\u660E\u7C7B\u578B\u5BF9\u8C61\u65F6\u629B\u51FA\u3002

java.lang.ClassCastException=\u7C7B\u9020\u578B\u5F02\u5E38\u3002\u5047\u8BBE\u6709\u7C7BA\u548CB\uFF08A\u4E0D\u662FB\u7684\u7236\u7C7B\u6216\u5B50\u7C7B\uFF09\uFF0CO\u662FA\u7684\u5B9E\u4F8B\uFF0C\u90A3\u4E48\u5F53\u5F3A\u5236\u5C06O\u6784\u9020\u4E3A\u7C7BB\u7684\u5B9E\u4F8B\u65F6\u629B\u51FA\u8BE5\u5F02\u5E38\u3002\u8BE5\u5F02\u5E38\u7ECF\u5E38\u88AB\u79F0\u4E3A\u5F3A\u5236\u7C7B\u578B\u8F6C\u6362\u5F02\u5E38\u3002

java.lang.ClassNotFoundException=\u627E\u4E0D\u5230\u7C7B\u5F02\u5E38\u3002\u5F53\u5E94\u7528\u8BD5\u56FE\u6839\u636E\u5B57\u7B26\u4E32\u5F62\u5F0F\u7684\u7C7B\u540D\u6784\u9020\u7C7B\uFF0C\u800C\u5728\u904D\u5386CLASSPAH\u4E4B\u540E\u627E\u4E0D\u5230\u5BF9\u5E94\u540D\u79F0\u7684class\u6587\u4EF6\u65F6\uFF0C\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.CloneNotSupportedException=\u4E0D\u652F\u6301\u514B\u9686\u5F02\u5E38\u3002\u5F53\u6CA1\u6709\u5B9E\u73B0Cloneable\u63A5\u53E3\u6216\u8005\u4E0D\u652F\u6301\u514B\u9686\u65B9\u6CD5\u65F6,\u8C03\u7528\u5176clone()\u65B9\u6CD5\u5219\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.EnumConstantNotPresentException=\u679A\u4E3E\u5E38\u91CF\u4E0D\u5B58\u5728\u5F02\u5E38\u3002\u5F53\u5E94\u7528\u8BD5\u56FE\u901A\u8FC7\u540D\u79F0\u548C\u679A\u4E3E\u7C7B\u578B\u8BBF\u95EE\u4E00\u4E2A\u679A\u4E3E\u5BF9\u8C61\uFF0C\u4F46\u8BE5\u679A\u4E3E\u5BF9\u8C61\u5E76\u4E0D\u5305\u542B\u5E38\u91CF\u65F6\uFF0C\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.Exception=\u6839\u5F02\u5E38\u3002\u7528\u4EE5\u63CF\u8FF0\u5E94\u7528\u7A0B\u5E8F\u5E0C\u671B\u6355\u83B7\u7684\u60C5\u51B5\u3002

java.lang.IllegalAccessException=\u8FDD\u6CD5\u7684\u8BBF\u95EE\u5F02\u5E38\u3002\u5F53\u5E94\u7528\u8BD5\u56FE\u901A\u8FC7\u53CD\u5C04\u65B9\u5F0F\u521B\u5EFA\u67D0\u4E2A\u7C7B\u7684\u5B9E\u4F8B\u3001\u8BBF\u95EE\u8BE5\u7C7B\u5C5E\u6027\u3001\u8C03\u7528\u8BE5\u7C7B\u65B9\u6CD5\uFF0C\u800C\u5F53\u65F6\u53C8\u65E0\u6CD5\u8BBF\u95EE\u7C7B\u7684\u3001\u5C5E\u6027\u7684\u3001\u65B9\u6CD5\u7684\u6216\u6784\u9020\u65B9\u6CD5\u7684\u5B9A\u4E49\u65F6\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.IllegalMonitorStateException=\u8FDD\u6CD5\u7684\u76D1\u63A7\u72B6\u6001\u5F02\u5E38\u3002\u5F53\u67D0\u4E2A\u7EBF\u7A0B\u8BD5\u56FE\u7B49\u5F85\u4E00\u4E2A\u81EA\u5DF1\u5E76\u4E0D\u62E5\u6709\u7684\u5BF9\u8C61\uFF08O\uFF09\u7684\u76D1\u63A7\u5668\u6216\u8005\u901A\u77E5\u5176\u4ED6\u7EBF\u7A0B\u7B49\u5F85\u8BE5\u5BF9\u8C61\uFF08O\uFF09\u7684\u76D1\u63A7\u5668\u65F6\uFF0C\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.IllegalStateException=\u8FDD\u6CD5\u7684\u72B6\u6001\u5F02\u5E38\u3002\u5F53\u5728Java\u73AF\u5883\u548C\u5E94\u7528\u5C1A\u672A\u5904\u4E8E\u67D0\u4E2A\u65B9\u6CD5\u7684\u5408\u6CD5\u8C03\u7528\u72B6\u6001\uFF0C\u800C\u8C03\u7528\u4E86\u8BE5\u65B9\u6CD5\u65F6\uFF0C\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.IllegalThreadStateException=\u8FDD\u6CD5\u7684\u7EBF\u7A0B\u72B6\u6001\u5F02\u5E38\u3002\u5F53\u53BF\u57CE\u5C1A\u672A\u5904\u4E8E\u67D0\u4E2A\u65B9\u6CD5\u7684\u5408\u6CD5\u8C03\u7528\u72B6\u6001\uFF0C\u800C\u8C03\u7528\u4E86\u8BE5\u65B9\u6CD5\u65F6\uFF0C\u629B\u51FA\u5F02\u5E38\u3002

java.lang.IndexOutOfBoundsException=\u7D22\u5F15\u8D8A\u754C\u5F02\u5E38\u3002\u5F53\u8BBF\u95EE\u67D0\u4E2A\u5E8F\u5217\u7684\u7D22\u5F15\u503C\u5C0F\u4E8E0\u6216\u5927\u4E8E\u7B49\u4E8E\u5E8F\u5217\u5927\u5C0F\u65F6\uFF0C\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.InstantiationException=\u5B9E\u4F8B\u5316\u5F02\u5E38\u3002\u5F53\u8BD5\u56FE\u901A\u8FC7newInstance()\u65B9\u6CD5\u521B\u5EFA\u67D0\u4E2A\u7C7B\u7684\u5B9E\u4F8B\uFF0C\u800C\u8BE5\u7C7B\u662F\u4E00\u4E2A\u62BD\u8C61\u7C7B\u6216\u63A5\u53E3\u65F6\uFF0C\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.InterruptedException=\u88AB\u4E2D\u6B62\u5F02\u5E38\u3002\u5F53\u67D0\u4E2A\u7EBF\u7A0B\u5904\u4E8E\u957F\u65F6\u95F4\u7684\u7B49\u5F85\u3001\u4F11\u7720\u6216\u5176\u4ED6\u6682\u505C\u72B6\u6001\uFF0C\u800C\u6B64\u65F6\u5176\u4ED6\u7684\u7EBF\u7A0B\u901A\u8FC7Thread\u7684interrupt\u65B9\u6CD5\u7EC8\u6B62\u8BE5\u7EBF\u7A0B\u65F6\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.NegativeArraySizeException=\u6570\u7EC4\u5927\u5C0F\u4E3A\u8D1F\u503C\u5F02\u5E38\u3002\u5F53\u4F7F\u7528\u8D1F\u6570\u5927\u5C0F\u503C\u521B\u5EFA\u6570\u7EC4\u65F6\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.NoSuchFieldException=\u5C5E\u6027\u4E0D\u5B58\u5728\u5F02\u5E38\u3002\u5F53\u8BBF\u95EE\u67D0\u4E2A\u7C7B\u7684\u4E0D\u5B58\u5728\u7684\u5C5E\u6027\u65F6\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.NoSuchMethodException=\u65B9\u6CD5\u4E0D\u5B58\u5728\u5F02\u5E38\u3002\u5F53\u8BBF\u95EE\u67D0\u4E2A\u7C7B\u7684\u4E0D\u5B58\u5728\u7684\u65B9\u6CD5\u65F6\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.NullPointerException=\u7A7A\u6307\u9488\u5F02\u5E38\u3002\u5F53\u5E94\u7528\u8BD5\u56FE\u5728\u8981\u6C42\u4F7F\u7528\u5BF9\u8C61\u7684\u5730\u65B9\u4F7F\u7528\u4E86null\u65F6\uFF0C\u629B\u51FA\u8BE5\u5F02\u5E38\u3002\u8B6C\u5982\uFF1A\u8C03\u7528null\u5BF9\u8C61\u7684\u5B9E\u4F8B\u65B9\u6CD5\u3001\u8BBF\u95EEnull\u5BF9\u8C61\u7684\u5C5E\u6027\u3001\u8BA1\u7B97null\u5BF9\u8C61\u7684\u957F\u5EA6\u3001\u4F7F\u7528throw\u8BED\u53E5\u629B\u51FAnull\u7B49\u7B49\u3002

java.lang.NumberFormatException=\u6570\u5B57\u683C\u5F0F\u5F02\u5E38\u3002\u5F53\u8BD5\u56FE\u5C06\u4E00\u4E2AString\u8F6C\u6362\u4E3A\u6307\u5B9A\u7684\u6570\u5B57\u7C7B\u578B\uFF0C\u800C\u8BE5\u5B57\u7B26\u4E32\u786E\u4E0D\u6EE1\u8DB3\u6570\u5B57\u7C7B\u578B\u8981\u6C42\u7684\u683C\u5F0F\u65F6\uFF0C\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.RuntimeException=\u8FD0\u884C\u65F6\u5F02\u5E38\u3002\u662F\u6240\u6709Java\u865A\u62DF\u673A\u6B63\u5E38\u64CD\u4F5C\u671F\u95F4\u53EF\u4EE5\u88AB\u629B\u51FA\u7684\u5F02\u5E38\u7684\u7236\u7C7B\u3002

java.lang.SecurityException=\u5B89\u5168\u5F02\u5E38\u3002\u7531\u5B89\u5168\u7BA1\u7406\u5668\u629B\u51FA\uFF0C\u7528\u4E8E\u6307\u793A\u8FDD\u53CD\u5B89\u5168\u60C5\u51B5\u7684\u5F02\u5E38\u3002

java.lang.StringIndexOutOfBoundsException=\u5B57\u7B26\u4E32\u7D22\u5F15\u8D8A\u754C\u5F02\u5E38\u3002\u5F53\u4F7F\u7528\u7D22\u5F15\u503C\u8BBF\u95EE\u67D0\u4E2A\u5B57\u7B26\u4E32\u4E2D\u7684\u5B57\u7B26\uFF0C\u800C\u8BE5\u7D22\u5F15\u503C\u5C0F\u4E8E0\u6216\u5927\u4E8E\u7B49\u4E8E\u5E8F\u5217\u5927\u5C0F\u65F6\uFF0C\u629B\u51FA\u8BE5\u5F02\u5E38\u3002

java.lang.TypeNotPresentException=\u7C7B\u578B\u4E0D\u5B58\u5728\u5F02\u5E38\u3002\u5F53\u5E94\u7528\u8BD5\u56FE\u4EE5\u67D0\u4E2A\u7C7B\u578B\u540D\u79F0\u7684\u5B57\u7B26\u4E32\u8868\u8FBE\u65B9\u5F0F\u8BBF\u95EE\u8BE5\u7C7B\u578B\uFF0C\u4F46\u662F\u6839\u636E\u7ED9\u5B9A\u7684\u540D\u79F0\u53C8\u627E\u4E0D\u5230\u8BE5\u7C7B\u578B\u662F\u629B\u51FA\u8BE5\u5F02\u5E38\u3002\u8BE5\u5F02\u5E38\u4E0EClassNotFoundException\u7684\u533A\u522B\u5728\u4E8E\u8BE5\u5F02\u5E38\u662Funchecked\uFF08\u4E0D\u88AB\u68C0\u67E5\uFF09\u5F02\u5E38\uFF0C\u800CClassNotFoundException\u662Fchecked\uFF08\u88AB\u68C0\u67E5\uFF09\u5F02\u5E38\u3002

java.lang.UnsupportedOperationException=\u4E0D\u652F\u6301\u7684\u65B9\u6CD5\u5F02\u5E38\u3002\u6307\u660E\u8BF7\u6C42\u7684\u65B9\u6CD5\u4E0D\u88AB\u652F\u6301\u60C5\u51B5\u7684\u5F02\u5E38\u3002
